tutorials/testcases/flowOverCylinder/Re3900/3d_transient_medium/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }

    inner
    {
        type            bellerophon;
        value           uniform 0;
    }
    "front|back"
    {
        type            cyclic;
    }
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    sides
    {
        type            zeroGradient;
    }

    outer
    {
        type            bellerophon;
        value           uniform 0;
    }
}


// ************************************************************************* //
