tutorials/testcases/flowOverCylinder/Re3900/3d_transient_medium/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11520;
        startFace       9055664;
    }
    inner
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          11520;
        startFace       9067184;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       outer;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          68314;
        startFace       9078704;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          68314;
        startFace       9147018;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       9215332;
    }
    outlet
    {
        type            patch;
        nFaces          5784;
        startFace       9215482;
    }
    sides
    {
        type            patch;
        nFaces          300;
        startFace       9221266;
    }
    outer
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          14208;
        startFace       9221566;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       inner;
    }
)

// ************************************************************************* //
