tutorials/testcases/flowOverCylinder/Re3900/3d_transient_medium/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          bellerophonPBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          1e-02;
        maxIter         600;
    }

    pFinal
    {
        $p
        tolerance       1e-05;
        relTol          1e-03;
    }

    "U|UFinal|k|kFinal|omega|omegaFinal|T"
    {
        $p
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          1e-05;
        maxIter         200;
    }
}

"PIMPLE|SIMPLE|PISO"
{
    nOuterCorrectors         1;
    nCorrectors              1;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
}

// ************************************************************************* //
